Repository: jfreissmann/heatpumps
Catalog: locales/*/LC_MESSAGES/dashboard.po
Languages: de

source: Design
de: Auslegung

source: Partload
de: Teillast

source: Parameter 'scale' must be either 'lin' or 'log'.
de: Der Parameter 'scale' muss entweder 'lin' oder 'log' sein.

source: is not allowed.
de: ist nicht erlaubt.

source: Heat Pump Dashboard
de: Wärmepumpen Dashboard

source: Select Mode
de: Auslegung der Wärmepumpe

source: Design of the Heat Pump
de: Auslegung der Wärmepumpe

source: Base Topology
de: Grundtopologie

source: Heat Pump Model
de: Wärmepumpenmodell

source: Process Type
de: Prozessart

source: subcritical
de: subkritisch

source: transcritical
de: transkritisch

source: Transcritical
de: Transkritisch

source: Internal Heat Exchange
de: Interne Wärmerübertragung

source: Superheating/Subcooling
de: Überhitzung/Unterkühlung

source: No. {i}: Superheating/Subcooling
de: Nr. {i}: Überhitzung/Unterkühlung

source: Refrigerant
de: Kältemittel

source: Refrigerant (High Temperature Circuit)
de: Kältemittel (Hochtemperaturkreis)

source: Refrigerant (Low Temperature Circuit)
de: Kältemittel (Niedertemperaturkreis)

source: Transcritical Pressure
de: Traskritischer Druck

source: Value in bar
de: Wert in bar

source: Thermal Nominal Power
de: Wärmequelle

source: Value in MW
de: Wert in MW

source: Forward Temperature
de: Temperatur Vorlauf

source: Return Temperature
de: Temperatur Rücklauf

source: The return temperature must be lower than the forward temperature.
de: Die Rücklauftemperatur muss niedriger sein, als die Vorlauftemperatur

source: Heat Sink
de: Wärmesenke

source: The temperature of the heat sink must be higher than the heat source.
de: Die Temperatur der Wärmesenke muss höher sein, als die der Wärmequelle.

source: Compressor
de: Verdichter

source: Efficiency $\eta_s$
de: Wirkungsgrad $\eta_s$

source: Efficiency $\eta_{s,1}$
de: Wirkungsgrad $\eta_{s,1}$

source: Efficiency $\eta_{s,2}$
de: Wirkungsgrad $\eta_{s,2}

source: Efficiency $\eta_{s,HTK}$
de: Wirkungsgrad $\eta_{s,HTK}$

source: Efficiency $\eta_{s,NTK}$
de: Wirkungsgrad $\eta_{s,NTK}$

source: Efficiency $\eta_{s,HTK,1}$
de: Wirkungsgrad $\eta_{s,HTK,1}$

source: Efficiency $\eta_{s,HTK,2}$
de: Wirkungsgrad $\eta_{s,HTK,2}$

source: Efficiency $\eta_{s,NTK,1}$
de: Wirkungsgrad $\eta_{s,NTK,1}$

source: Efficiency $\eta_{s,NTK,2}$
de: Wirkungsgrad $\eta_{s,NTK,2}$

source: Ambient Conditions (Exergy)
de: Umgebungsbedingungen (Exergie)

source: Temperature
de: Temperatur

source: Parameters for Cost Calculation
de: Parameter zur Kostenkalkulation

source: Heat Transfer Coefficient (Evaporation)
de: Wärmedurchgangskoeffizient (Verdampfung)

source: Heat Transfer Coefficient (Transcritical)
de: Wärmedurchgangskoeffizient (Transkritisch)

source: Heat Transfer Coefficient (Miscellaneous)
de: Wärmedurchgangskoeffizient (Sonstige)

source: 🧮 Execute Design
de: 🧮 Auslegung ausführen

source: Part Load
de: Teillast

source: Part Load Simulation of the Heat Pump
de: Teillastsimulation der Wärmepumpe

source: Constant
de: Konstant

source: Variable
de: Variabel

source: Start Temperature
de: Starttemperatur

source: End Temperature
de: Endtemperatur

source: 🧮 Simulate Part Load
de: 🧮 Teillast simulieren

source: *heatpumps*
de: *Wärmepumpe*

source: The heat pump simulator *heatpumps* is a powerful simulation software for analyzing and evaluating heat pumps. This dashboard allows you to control a variety of complex thermodynamic plant models using numerical methods via a simple interface, without requiring expert knowledge. This includes both the design of heat pumps as well as the simulation of their steady-state part load operation. The simulation results provide insights into the pump's behavior, COP, state variables, and costs of individual components as well as total investment costs. This enables access to complex questions that frequently arise in the design and planning of heat pumps. ### Key Features - Steady-state design and part load simulation based on [TESPy](https://github.com/oemof/tespy) - Parameterization and result visualization via a [Streamlit](https://github.com/streamlit/streamlit) dashboard - Common circuit topologies used in industry, research, and development - Subcritical and transcritical processes - Large selection of working fluids thanks to [CoolProp](https://github.com/CoolProp/CoolProp) integration
de: Der Wärmepumpensimulator *heatpumps* ist eine leistungsfähige Simulationssoftware zur Analyse und Bewertung von Wärmepumpen. Mit diesem Dashboard lassen sich eine Vielzahl komplexer thermodynamischer Anlagenmodelle mithilfe numerischer Methoden über eine einfache Oberfläche steuern, ohne Fachkenntnisse über diese vorauszusetzen. Dies beinhaltet sowohl die Auslegung von Wärmepumpen, als auch die Simulation ihres stationären Teillastbetriebs. Dabei geben die Ergebnisse der Simulationen Aufschluss über das prinzipielle Verhalten, den COP, Zustandsgrößen und Kosten der einzelnen Komponenten sowie Gesamtinvestitionskosten der betrachteten Wärmepumpe. Damit wird Zugang zu komplexen Fragestellungen ermöglicht, die regelmäßig in der Konzeption und Planung von Wärmepumpen aufkommen. ### Key Features - Stationäre Auslegungs- und Teillastsimulation basierend auf [TESPy](https://github.com/oemof/tespy) - Parametrisierung and Ergebnisvisualisierung mithilfe eines [Streamlit](https://github.com/streamlit/streamlit) Dashboards - In der Industrie, Forschung und Entwicklung gängige Schaltungstopologien - Sub- und transkritische Prozesse - Große Auswahl an Arbeitsmedien aufgrund der Integration von [CoolProp](https://github.com/CoolProp/CoolProp)

source: Start Design
de: Auslegung starten

source: Used Software
de: Verwendete Software

source: #### Used Software: The open-source software TESPy is used for modeling and simulating the systems. Additionally, a number of other Python packages are used for data processing, preparation, and visualization. --- #### TESPy: TESPy (Thermal Engineering Systems in Python) is a powerful simulation tool for thermal process engineering, such as power plants, district heating systems, or heat pumps. The TESPy package allows for system design and steady-state operation simulation. After that, part load behavior can be determined based on the characteristics of each component of the system. The component-based structure combined with the solution method offers great flexibility regarding the system topology and parameterization. More information on TESPy can be found in its [online documentation](https://tespy.readthedocs.io) (in English). #### Other Packages: - [Streamlit](https://docs.streamlit.io) (Graphical User Interface) - [NumPy](https://numpy.org) (Data Processing) - [pandas](https://pandas.pydata.org) (Data Processing) - [SciPy](https://scipy.org/) (Interpolation) - [scikit-learn](https://scikit-learn.org) (Regression) - [Matplotlib](https://matplotlib.org) (Data Visualization) - [FluProDia](https://fluprodia.readthedocs.io) (Data Visualization) - [CoolProp](http://www.coolprop.org) (Fluid Properties)
de: #### Verwendete Software: Zur Modellerstellung und Berechnung der Simulationen wird die Open Source Software TESPy verwendet. Des Weiteren werden eine Reihe weiterer Pythonpakete zur Datenverarbeitung, -aufbereitung und -visualisierung genutzt. --- #### TESPy: TESPy (Thermal Engineering Systems in Python) ist ein leistungsfähiges Simulationswerkzeug für thermische Verfahrenstechnik, zum Beispiel für Kraftwerke, Fernwärmesysteme oder Wärmepumpen. Mit dem TESPy-Paket ist es möglich, Anlagen auszulegen und den stationären Betrieb zu simulieren. Danach kann das Teillastverhalten anhand der zugrundeliegenden Charakteristiken für jede Komponente der Anlage ermittelt werden. Die komponentenbasierte Struktur in Kombination mit der Lösungsmethode bieten eine sehr hohe Flexibilität hinsichtlich der Anlagentopologie und der Parametrisierung. Weitere Informationen zu TESPy sind in dessen [Onlinedokumentation](https://tespy.readthedocs.io) in englischer Sprache zu finden. #### Weitere Pakete: - [Streamlit](https://docs.streamlit.io) (Graphische Oberfläche) - [NumPy](https://numpy.org) (Datenverarbeitung) - [pandas](https://pandas.pydata.org) (Datenverarbeitung) - [SciPy](https://scipy.org/) (Interpolation) - [scikit-learn](https://scikit-learn.org) (Regression) - [Matplotlib](https://matplotlib.org) (Datenvisualisierung) - [FluProDia](https://fluprodia.readthedocs.io) (Datenvisualisierung) - [CoolProp](http://www.coolprop.org) (Stoffdaten)

source: #### Simulation Results: Numerical simulations are calculations performed using appropriate iterative methods based on the specified boundary conditions and parameters. In some cases, it is not possible to account for all possible influences, so deviations from real-world experience may occur and should be taken into account when evaluating the results. The results provide sufficient to exact insights into the heat pump's general behavior, COP, and state variables in each component. Nevertheless, all information and results are provided without guarantee.
de: #### Simulationsergebnisse: Numerische Simulationen sind Berechnungen mittels geeigneter Iterationsverfahren in Bezug auf die vorgegebenen und gesetzten Randbedingungen und Parameter. Eine Berücksichtigung aller möglichen Einflüsse ist in Einzelfällen nicht möglich, so dass Abweichungen zu Erfahrungswerten aus Praxisanwendungen entstehen können und bei der Bewertung berücksichtigt werden müssen. Die Ergebnisse geben hinreichenden bis genauen Aufschluss über das prinzipielle Verhalten, den COP und Zustandsgrößen in den einzelnen Komponenten der Wärmepumpe. Dennoch sind alle Angaben und Ergebnisse ohne Gewähr.

source: Copyright
de: Urheberrecht

source: Topology
de: Topologie

source: #### High-Temperature Circuit
de: #### Hochtemperaturkreis

source: #### Low-Temperature Circuit
de: #### Niedertemperaturkreis

source: All substance data and classifications from [CoolProp](http://www.coolprop.org) or [Arpagaus et al. (2018)](https://doi.org/10.1016/j.energy.2018.03.166)
de: Alle Stoffdaten und Klassifikationen aus [CoolProp](http://www.coolprop.org) oder [Arpagaus et al. (2018)](https://doi.org/10.1016/j.energy.2018.03.166)

source: #### Instructions You are now on the design simulation interface for your heat pump. In the left sidebar, next to the dimensioning and the choice of refrigerant, several central parameters for the cycle process must be specified. These include, for example, the temperatures of the heat source and sink, but also the associated network pressures. Additionally, an internal heat exchanger can be optionally added. The resulting superheat of the evaporated refrigerant must also be specified. Once the design simulation is successfully completed, the generated results are processed graphically in state diagrams and quantified. Key metrics such as the coefficient of performance (COP), as well as relevant heat flows and power outputs, will be shown. Furthermore, thermodynamic state variables at each process step will be listed in a table. After the design simulation, a button will appear allowing you to switch to the partial load interface. This can also be done via the dropdown menu in the sidebar. Information on how to perform partial load simulations is available on the start page of this interface.
de: #### Anleitung Sie befinden sich auf der Oberfläche zur Auslegungssimulation Ihrer Wärmepumpe. Dazu sind links in der Sidebar neben der Dimensionierung und der Wahl des zu verwendenden Kältemittels verschiedene zentrale Parameter des Kreisprozesse vorzugeben. Dies sind zum Beispiel die Temperaturen der Wärmequelle und -senke, aber auch die dazugehörigen Netzdrücke. Darüber hinaus kann optional ein interner Wärmeübertrager hinzugefügt werden. Dazu ist weiterhin die resultierende Überhitzung des verdampften Kältemittels vorzugeben. Ist die Auslegungssimulation erfolgreich abgeschlossen, werden die generierten Ergebnisse graphisch in Zustandsdiagrammen aufgearbeitet und quantifiziert. Die zentralen Größen wie die Leistungszahl (COP) sowie die relevanten Wärmeströme und Leistung werden aufgeführt. Darüber hinaus werden die thermodynamischen Zustandsgrößen in allen Prozessschritten tabellarisch aufgelistet. Im Anschluss an die Auslegungsimulation erscheint ein Knopf zum Wechseln in die Teillastoberfläche. Dies kann ebenfalls über das Dropdownmenü in der Sidebar erfolgen. Informationen zur Durchführung der Teillastsimulationen befindet sich auf der Startseite dieser Oberfläche.

source: Running simulation...
de: Simulation wird durchgeführt...

source: The heat pump design simulation was successful.
de: Die Simulation der Wärmepumpenauslegung war erfolgreich.

source: An error occurred during the heat pump simulation. Please correct the input parameters and try again.
de: Bei der Simulation der Wärmepumpe ist der nachfolgende Fehler aufgetreten. Bitte korrigieren Sie die Eingangsparameter und versuchen es erneut.

source: Visualizing results...
de: Ergebnisse werden visualisiert...

source: Design Results
de: Ergebnisse der Auslegung

source: Topology & Refrigerant
de: Topologie & Kältemittel

source: All substance data and classifications from [CoolProp](http://www.coolprop.org) or [Arpagaus et al. (2018)](https://doi.org/10.1016/j.energy.2018.03.166)
de: Alle Stoffdaten und Klassifikationen aus [CoolProp](http://www.coolprop.org) oder [Arpagaus et al. (2018)](https://doi.org/10.1016/j.energy.2018.03.166)

source: State Diagrams
de: Zustandsdiagramme

source: Log(p)-h Diagram
de: Log(p)-h Diagramm

source: T-s Diagram
de: T-s Diagramm

source: State Quantities
de: Zustandsgrößen

source: Economic Assessment
de: Ökonomische Bewertung

source: Total Investment Costs
de: Gesamtinvestitionskosten

source: Specific Investment Costs
de: Spez. Investitionskosten

source: Methodology for cost calculation analogous to [Kosmadakis et al. (2020)](https://doi.org/10.1016/j.enconman.2020.113488), based on [Bejan et al. (1995)](https://www.wiley.com/en-us/Thermal+Design+and+Optimization-p-9780471584674).
de: Methodik zur Berechnung der Kosten analog zu [Kosmadakis et al. (2020)](https://doi.org/10.1016/j.enconman.2020.113488), basierend auf [Bejan et al. (1995)](https://www.wiley.com/en-us/Thermal+Design+and+Optimization-p-9780471584674).

source: Exergy Assessment
de: Exergiebewertung

source: Results of the Exergy Analysis
de: Ergebnisse der Exergieanalyse

source: Results by Component
de: Ergebnisse nach Komponente

source: Grassmann Diagram
de: Grassmann Diagramm

source: Waterfall Diagram
de: Wasserfall Diagramm

source: Definitions and methodology of the exergy analysis based on [Morosuk and Tsatsaronis (2019)](https://doi.org/10.1016/j.energy.2018.10.090), its implementation in TESPy described in [Witte and Hofmann et al. (2022)](https://doi.org/10.3390/en15114087) and pedagogically prepared in [Witte, Freißmann and Fritz (2023)](https://fwitte.github.io/TESPy_teaching_exergy/).
de: Definitionen und Methodik der Exergieanalyse basierend auf [Morosuk und Tsatsaronis (2019)](https://doi.org/10.1016/j.energy.2018.10.090), dessen Implementation in TESPy beschrieben in [Witte und Hofmann et al. (2022)](https://doi.org/10.3390/en15114087) und didaktisch aufbereitet in [Witte, Freißmann und Fritz (2023)](https://fwitte.github.io/TESPy_teaching_exergy/).

source: To calculate the partial load, click on "Simulate Partial Load".
de: Um die Teillast zu berechnen, drücke auf "Teillast simulieren".

source: Simulate Partial Load
de: Teillast simulieren

source: Operating Characteristics
de: Betriebscharakteristik

source: To perform a partial load simulation, a heat pump must first be designed. Please switch to the "Design" mode first.
de: Um eine Teillastsimulation durchzuführen, muss zunächst eine Wärmepumpe ausgelegt werden. Wechseln Sie bitte zunächst in den Modus "Auslegung".

source: Parameterization of the partial load calculation: + Percentage share of partial load + Range of source temperature + Range of sink temperature
de: Parametrisierung der Teillastberechnung: + Prozentualer Anteil Teillast + Bereich der Quelltemperatur + Bereich der Senkentemperatur

source: Partial load simulation is running... This may take a while.
de: Teillastsimulation wird durchgeführt... Dies kann eine Weile dauern.

source: The simulation of the heat pump characteristics was successful.
de: Die Simulation der Wärmepumpencharakteristika war erfolgreich.

source: Results are being visualized...
de: Ergebnisse werden visualisiert...

source: Diagrams
de: Diagramme

source: Source Temperature
de: Quellentemperatur

source: Exergy Analysis Partial Load
de: Exergieanalyse Teillast

source: Design New Heat Pump
de: Neue Wärmepumpe auslegen
