Repository: jfreissmann/heatpumps
Catalog: locales/*/LC_MESSAGES/variables.po
Languages: de

source: Simple cycle
de: Einfacher Zyklus

source: Intercooler
de: Zwischenkühler

source: Economizer
de: Wärmetauscher

source: Flashtank
de: Entspannungsbehälter

source: Cascade cycle
de: Kaskadenzyklus

source: General
de: Allgemein

source: Closed
de: Geschlossen

source: Double Internal Heat Exchanger
de: Doppelte interne WÜT

source: Internal Heat Exchanger
de: Interne WÜT

source: Internal Heat Exchanger (Variant A)
de: Interne WÜT (Variant A)

source: Internal Heat Exchanger (Variant B)
de: Interne WÜT (Variant B)

source: Open
de: Offen

source: Parallel Connection
de: Parallelschaltung

source: Serial Connection
de: Serielle Verbindung

source: Transcritical
de: Transkritisch

source: open
de: offen

source: closed
de: geschlossen

source: series
de: Reihenschaltung

source: parallel
de: Parallelschaltung
